program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3400.43.1"}, {"coremlc-version", "3400.58.2"}, {"coremltools-component-torch", "2.2.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2"}})]
{
    func main<ios17>(tensor<fp16, [1, 4, 64, 64]> noisy_next_obs, tensor<fp32, [1, 4]> prev_act, tensor<fp16, [1, 16, 64, 64]> prev_obs, tensor<fp16, [1]> sigma) {
            tensor<fp16, [1]> sigma_adj_cast_fp16 = identity(x = sigma)[name = tensor<string, []>("sigma_adj_cast_fp16")];
            tensor<fp16, []> var_12_promoted_to_fp16 = const()[name = tensor<string, []>("op_12_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1]> var_13_cast_fp16 = pow(x = sigma_adj_cast_fp16, y = var_12_promoted_to_fp16)[name = tensor<string, []>("op_13_cast_fp16")];
            tensor<fp16, []> var_15_to_fp16 = const()[name = tensor<string, []>("op_15_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1]> var_16_cast_fp16 = add(x = var_13_cast_fp16, y = var_15_to_fp16)[name = tensor<string, []>("op_16_cast_fp16")];
            tensor<fp16, [1]> var_17_cast_fp16 = sqrt(x = var_16_cast_fp16)[name = tensor<string, []>("op_17_cast_fp16")];
            tensor<fp32, []> var_18_epsilon_0 = const()[name = tensor<string, []>("op_18_epsilon_0"), val = tensor<fp32, []>(0x1.a36e2ep-14)];
            tensor<fp16, [1]> var_18_cast_fp16 = inverse(epsilon = var_18_epsilon_0, x = var_17_cast_fp16)[name = tensor<string, []>("op_18_cast_fp16")];
            tensor<fp32, []> var_26_epsilon_0 = const()[name = tensor<string, []>("op_26_epsilon_0"), val = tensor<fp32, []>(0x1.a36e2ep-14)];
            tensor<fp16, [1]> var_26_cast_fp16 = inverse(epsilon = var_26_epsilon_0, x = var_16_cast_fp16)[name = tensor<string, []>("op_26_cast_fp16")];
            tensor<fp16, []> var_27_to_fp16 = const()[name = tensor<string, []>("op_27_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1]> c_skip_1_cast_fp16 = mul(x = var_26_cast_fp16, y = var_27_to_fp16)[name = tensor<string, []>("c_skip_1_cast_fp16")];
            tensor<fp16, [1]> var_29_cast_fp16 = sqrt(x = c_skip_1_cast_fp16)[name = tensor<string, []>("op_29_cast_fp16")];
            tensor<fp16, [1]> c_out_1_cast_fp16 = mul(x = sigma_adj_cast_fp16, y = var_29_cast_fp16)[name = tensor<string, []>("c_out_1_cast_fp16")];
            tensor<fp32, []> var_31_epsilon_0 = const()[name = tensor<string, []>("op_31_epsilon_0"), val = tensor<fp32, []>(0x1p-149)];
            tensor<fp16, [1]> var_31_cast_fp16 = log(epsilon = var_31_epsilon_0, x = sigma_adj_cast_fp16)[name = tensor<string, []>("op_31_cast_fp16")];
            tensor<fp16, []> _inversed_c_noise_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_c_noise_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1]> _inversed_c_noise_cast_fp16 = mul(x = var_31_cast_fp16, y = _inversed_c_noise_y_0_to_fp16)[name = tensor<string, []>("_inversed_c_noise_cast_fp16")];
            tensor<int32, [4]> var_44 = const()[name = tensor<string, []>("op_44"), val = tensor<int32, [4]>([-1, 1, 1, 1])];
            tensor<fp16, [1, 1, 1, 1]> c_in_cast_fp16 = reshape(shape = var_44, x = var_18_cast_fp16)[name = tensor<string, []>("c_in_cast_fp16")];
            tensor<int32, [4]> var_50 = const()[name = tensor<string, []>("op_50"), val = tensor<int32, [4]>([-1, 1, 1, 1])];
            tensor<fp16, [1, 1, 1, 1]> c_skip_cast_fp16 = reshape(shape = var_50, x = c_skip_1_cast_fp16)[name = tensor<string, []>("c_skip_cast_fp16")];
            tensor<int32, [4]> var_56 = const()[name = tensor<string, []>("op_56"), val = tensor<int32, [4]>([-1, 1, 1, 1])];
            tensor<fp16, [1, 1, 1, 1]> c_out_cast_fp16 = reshape(shape = var_56, x = c_out_1_cast_fp16)[name = tensor<string, []>("c_out_cast_fp16")];
            tensor<fp16, []> _inversed_obs_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_obs_y_0_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 16, 64, 64]> _inversed_obs_cast_fp16 = mul(x = prev_obs, y = _inversed_obs_y_0_to_fp16)[name = tensor<string, []>("_inversed_obs_cast_fp16")];
            tensor<fp16, [1, 4, 64, 64]> noisy_next_obs_cast_fp16 = mul(x = noisy_next_obs, y = c_in_cast_fp16)[name = tensor<string, []>("noisy_next_obs_cast_fp16")];
            tensor<int32, []> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_85 = const()[name = tensor<string, []>("op_85"), val = tensor<int32, []>(1)];
            tensor<int32, []> input_1_axis_0 = const()[name = tensor<string, []>("input_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> input_1_batch_dims_0 = const()[name = tensor<string, []>("input_1_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> input_1_validate_indices_0 = const()[name = tensor<string, []>("input_1_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 128]> inner_model_act_emb_0_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_act_emb_0_weight_to_fp16"), val = tensor<fp16, [2, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<string, []> cast_10_to_int16_dtype_0 = const()[name = tensor<string, []>("cast_10_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<int16, [1, 4]> cast_61 = cast(dtype = cast_10_to_int16_dtype_0, x = prev_act)[name = tensor<string, []>("cast_61")];
            tensor<fp16, [1, 4, 128]> input_1_cast_fp16_cast_uint16 = gather(axis = input_1_axis_0, batch_dims = input_1_batch_dims_0, indices = cast_61, validate_indices = input_1_validate_indices_0, x = inner_model_act_emb_0_weight_to_fp16)[name = tensor<string, []>("input_1_cast_fp16_cast_uint16")];
            tensor<int32, [2]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [2]>([1, 512])];
            tensor<fp16, [1, 512]> act_emb_1_cast_fp16 = reshape(shape = concat_0, x = input_1_cast_fp16_cast_uint16)[name = tensor<string, []>("act_emb_1_cast_fp16")];
            tensor<int32, [1]> var_99_axes_0 = const()[name = tensor<string, []>("op_99_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1]> var_99_cast_fp16 = expand_dims(axes = var_99_axes_0, x = _inversed_c_noise_cast_fp16)[name = tensor<string, []>("op_99_cast_fp16")];
            tensor<fp16, []> var_100_to_fp16 = const()[name = tensor<string, []>("op_100_to_fp16"), val = tensor<fp16, []>(0x1.92p+2)];
            tensor<fp16, [1, 1]> var_101_cast_fp16 = mul(x = var_99_cast_fp16, y = var_100_to_fp16)[name = tensor<string, []>("op_101_cast_fp16")];
            tensor<fp16, [256, 1]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(640)))];
            tensor<fp16, [256]> f_1_bias_0_to_fp16 = const()[name = tensor<string, []>("f_1_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1216)))];
            tensor<fp16, [1, 256]> f_1_cast_fp16 = linear(bias = f_1_bias_0_to_fp16, weight = transpose_0_to_fp16, x = var_101_cast_fp16)[name = tensor<string, []>("f_1_cast_fp16")];
            tensor<fp16, [1, 256]> var_103_cast_fp16 = cos(x = f_1_cast_fp16)[name = tensor<string, []>("op_103_cast_fp16")];
            tensor<fp16, [1, 256]> var_104_cast_fp16 = sin(x = f_1_cast_fp16)[name = tensor<string, []>("op_104_cast_fp16")];
            tensor<bool, []> var_106_interleave_0 = const()[name = tensor<string, []>("op_106_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512]> var_106_cast_fp16 = concat(axis = var_84, interleave = var_106_interleave_0, values = (var_103_cast_fp16, var_104_cast_fp16))[name = tensor<string, []>("op_106_cast_fp16")];
            tensor<fp16, [1, 512]> var_115_to_fp16 = const()[name = tensor<string, []>("op_115_to_fp16"), val = tensor<fp16, [1, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1792)))];
            tensor<fp16, [1, 512]> var_116_cast_fp16 = add(x = var_106_cast_fp16, y = var_115_to_fp16)[name = tensor<string, []>("op_116_cast_fp16")];
            tensor<fp16, [1, 512]> input_5_cast_fp16 = add(x = var_116_cast_fp16, y = act_emb_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [512, 512]> inner_model_cond_proj_0_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_0_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2880)))];
            tensor<fp16, [512]> inner_model_cond_proj_0_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_0_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(527232)))];
            tensor<fp16, [1, 512]> linear_0_cast_fp16 = linear(bias = inner_model_cond_proj_0_bias_to_fp16, weight = inner_model_cond_proj_0_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [1, 512]> input_9_cast_fp16 = silu(x = linear_0_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [512, 512]> inner_model_cond_proj_2_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_2_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(528320)))];
            tensor<fp16, [512]> inner_model_cond_proj_2_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1052672)))];
            tensor<fp16, [1, 512]> linear_1_cast_fp16 = linear(bias = inner_model_cond_proj_2_bias_to_fp16, weight = inner_model_cond_proj_2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<bool, []> input_11_interleave_0 = const()[name = tensor<string, []>("input_11_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 64, 64]> input_11_cast_fp16 = concat(axis = var_85, interleave = input_11_interleave_0, values = (_inversed_obs_cast_fp16, noisy_next_obs_cast_fp16))[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_131 = const()[name = tensor<string, []>("op_131"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_1_pad_type_0 = const()[name = tensor<string, []>("x_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 20, 3, 3]> inner_model_conv_in_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_conv_in_weight_to_fp16"), val = tensor<fp16, [32, 20, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1053760)))];
            tensor<fp16, [32]> inner_model_conv_in_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_conv_in_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1065344)))];
            tensor<fp16, [1, 32, 64, 64]> x_1_cast_fp16 = conv(bias = inner_model_conv_in_bias_to_fp16, dilations = var_133, groups = var_85, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = var_131, weight = inner_model_conv_in_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([1, 1, 32, 64, 64])];
            tensor<fp16, [1, 1, 32, 64, 64]> reshape_0_cast_fp16 = reshape(shape = reshape_0_shape_0, x = x_1_cast_fp16)[name = tensor<string, []>("reshape_0_cast_fp16")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_0_cast_fp16 = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast_fp16)[name = tensor<string, []>("reduce_mean_0_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> sub_0_cast_fp16 = sub(x = reshape_0_cast_fp16, y = reduce_mean_0_cast_fp16)[name = tensor<string, []>("sub_0_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> square_0_cast_fp16 = square(x = sub_0_cast_fp16)[name = tensor<string, []>("square_0_cast_fp16")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_2_cast_fp16 = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast_fp16)[name = tensor<string, []>("reduce_mean_2_cast_fp16")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1, 1]> add_0_cast_fp16 = add(x = reduce_mean_2_cast_fp16, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1, 1]> sqrt_0_cast_fp16 = sqrt(x = add_0_cast_fp16)[name = tensor<string, []>("sqrt_0_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> real_div_0_cast_fp16 = real_div(x = sub_0_cast_fp16, y = sqrt_0_cast_fp16)[name = tensor<string, []>("real_div_0_cast_fp16")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([1, 32, 64, 64])];
            tensor<fp16, [1, 32, 64, 64]> reshape_1_cast_fp16 = reshape(shape = reshape_1_shape_0, x = real_div_0_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<fp16, [64, 512]> inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_weight_to_fp16"), val = tensor<fp16, [64, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1065472)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1131072)))];
            tensor<fp16, [1, 64]> linear_2_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [1]> var_190_axes_0 = const()[name = tensor<string, []>("op_190_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 1]> var_190_cast_fp16 = expand_dims(axes = var_190_axes_0, x = linear_2_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<int32, [1]> var_191_axes_0 = const()[name = tensor<string, []>("op_191_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 64, 1, 1]> var_191_cast_fp16 = expand_dims(axes = var_191_axes_0, x = var_190_cast_fp16)[name = tensor<string, []>("op_191_cast_fp16")];
            tensor<int32, [2]> var_192_split_sizes_0 = const()[name = tensor<string, []>("op_192_split_sizes_0"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_192_axis_0 = const()[name = tensor<string, []>("op_192_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 1, 1]> var_192_cast_fp16_0, tensor<fp16, [1, 32, 1, 1]> var_192_cast_fp16_1 = split(axis = var_192_axis_0, split_sizes = var_192_split_sizes_0, x = var_191_cast_fp16)[name = tensor<string, []>("op_192_cast_fp16")];
            tensor<fp16, []> var_194_promoted_to_fp16 = const()[name = tensor<string, []>("op_194_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 32, 1, 1]> var_195_cast_fp16 = add(x = var_192_cast_fp16_0, y = var_194_promoted_to_fp16)[name = tensor<string, []>("op_195_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> var_196_cast_fp16 = mul(x = reshape_1_cast_fp16, y = var_195_cast_fp16)[name = tensor<string, []>("op_196_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_15_cast_fp16 = add(x = var_196_cast_fp16, y = var_192_cast_fp16_1)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_17_cast_fp16 = silu(x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [2]> var_201 = const()[name = tensor<string, []>("op_201"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_7_pad_type_0 = const()[name = tensor<string, []>("x_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_7_pad_0 = const()[name = tensor<string, []>("x_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> inner_model_unet_d_blocks_0_resblocks_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv1_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1131264)))];
            tensor<fp16, [32]> inner_model_unet_d_blocks_0_resblocks_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1149760)))];
            tensor<fp16, [1, 32, 64, 64]> x_7_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_0_conv1_bias_to_fp16, dilations = var_203, groups = var_85, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = var_201, weight = inner_model_unet_d_blocks_0_resblocks_0_conv1_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [5]> reshape_2_shape_0 = const()[name = tensor<string, []>("reshape_2_shape_0"), val = tensor<int32, [5]>([1, 1, 32, 64, 64])];
            tensor<fp16, [1, 1, 32, 64, 64]> reshape_2_cast_fp16 = reshape(shape = reshape_2_shape_0, x = x_7_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_3_cast_fp16 = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_2_cast_fp16)[name = tensor<string, []>("reduce_mean_3_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> sub_2_cast_fp16 = sub(x = reshape_2_cast_fp16, y = reduce_mean_3_cast_fp16)[name = tensor<string, []>("sub_2_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> square_1_cast_fp16 = square(x = sub_2_cast_fp16)[name = tensor<string, []>("square_1_cast_fp16")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_5_cast_fp16 = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast_fp16)[name = tensor<string, []>("reduce_mean_5_cast_fp16")];
            tensor<fp16, []> add_1_y_0_to_fp16 = const()[name = tensor<string, []>("add_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1, 1]> add_1_cast_fp16 = add(x = reduce_mean_5_cast_fp16, y = add_1_y_0_to_fp16)[name = tensor<string, []>("add_1_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1, 1]> sqrt_1_cast_fp16 = sqrt(x = add_1_cast_fp16)[name = tensor<string, []>("sqrt_1_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> real_div_1_cast_fp16 = real_div(x = sub_2_cast_fp16, y = sqrt_1_cast_fp16)[name = tensor<string, []>("real_div_1_cast_fp16")];
            tensor<int32, [4]> reshape_3_shape_0 = const()[name = tensor<string, []>("reshape_3_shape_0"), val = tensor<int32, [4]>([1, 32, 64, 64])];
            tensor<fp16, [1, 32, 64, 64]> reshape_3_cast_fp16 = reshape(shape = reshape_3_shape_0, x = real_div_1_cast_fp16)[name = tensor<string, []>("reshape_3_cast_fp16")];
            tensor<fp16, [64, 512]> inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_weight_to_fp16"), val = tensor<fp16, [64, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1149888)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1215488)))];
            tensor<fp16, [1, 64]> linear_3_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<int32, [1]> var_213_axes_0 = const()[name = tensor<string, []>("op_213_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 1]> var_213_cast_fp16 = expand_dims(axes = var_213_axes_0, x = linear_3_cast_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<int32, [1]> var_214_axes_0 = const()[name = tensor<string, []>("op_214_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 64, 1, 1]> var_214_cast_fp16 = expand_dims(axes = var_214_axes_0, x = var_213_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<int32, [2]> var_215_split_sizes_0 = const()[name = tensor<string, []>("op_215_split_sizes_0"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_215_axis_0 = const()[name = tensor<string, []>("op_215_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 1, 1]> var_215_cast_fp16_0, tensor<fp16, [1, 32, 1, 1]> var_215_cast_fp16_1 = split(axis = var_215_axis_0, split_sizes = var_215_split_sizes_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_215_cast_fp16")];
            tensor<fp16, []> var_217_promoted_to_fp16 = const()[name = tensor<string, []>("op_217_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 32, 1, 1]> var_218_cast_fp16 = add(x = var_215_cast_fp16_0, y = var_217_promoted_to_fp16)[name = tensor<string, []>("op_218_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> var_219_cast_fp16 = mul(x = reshape_3_cast_fp16, y = var_218_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_19_cast_fp16 = add(x = var_219_cast_fp16, y = var_215_cast_fp16_1)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_21_cast_fp16 = silu(x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [2]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_11_pad_type_0 = const()[name = tensor<string, []>("x_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_11_pad_0 = const()[name = tensor<string, []>("x_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> inner_model_unet_d_blocks_0_resblocks_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv2_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1215680)))];
            tensor<fp16, [32]> inner_model_unet_d_blocks_0_resblocks_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1234176)))];
            tensor<fp16, [1, 32, 64, 64]> x_11_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_0_conv2_bias_to_fp16, dilations = var_226, groups = var_85, pad = x_11_pad_0, pad_type = x_11_pad_type_0, strides = var_224, weight = inner_model_unet_d_blocks_0_resblocks_0_conv2_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> x_13_cast_fp16 = add(x = x_11_cast_fp16, y = x_1_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([1, 1, 32, 64, 64])];
            tensor<fp16, [1, 1, 32, 64, 64]> reshape_4_cast_fp16 = reshape(shape = reshape_4_shape_0, x = x_13_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_6_cast_fp16 = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_4_cast_fp16)[name = tensor<string, []>("reduce_mean_6_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> sub_4_cast_fp16 = sub(x = reshape_4_cast_fp16, y = reduce_mean_6_cast_fp16)[name = tensor<string, []>("sub_4_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> square_2_cast_fp16 = square(x = sub_4_cast_fp16)[name = tensor<string, []>("square_2_cast_fp16")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_8_cast_fp16 = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast_fp16)[name = tensor<string, []>("reduce_mean_8_cast_fp16")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1, 1]> add_2_cast_fp16 = add(x = reduce_mean_8_cast_fp16, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1, 1]> sqrt_2_cast_fp16 = sqrt(x = add_2_cast_fp16)[name = tensor<string, []>("sqrt_2_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> real_div_2_cast_fp16 = real_div(x = sub_4_cast_fp16, y = sqrt_2_cast_fp16)[name = tensor<string, []>("real_div_2_cast_fp16")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([1, 32, 64, 64])];
            tensor<fp16, [1, 32, 64, 64]> reshape_5_cast_fp16 = reshape(shape = reshape_5_shape_0, x = real_div_2_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<fp16, [64, 512]> inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_weight_to_fp16"), val = tensor<fp16, [64, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1234304)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1299904)))];
            tensor<fp16, [1, 64]> linear_4_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [1]> var_241_axes_0 = const()[name = tensor<string, []>("op_241_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 1]> var_241_cast_fp16 = expand_dims(axes = var_241_axes_0, x = linear_4_cast_fp16)[name = tensor<string, []>("op_241_cast_fp16")];
            tensor<int32, [1]> var_242_axes_0 = const()[name = tensor<string, []>("op_242_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 64, 1, 1]> var_242_cast_fp16 = expand_dims(axes = var_242_axes_0, x = var_241_cast_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<int32, [2]> var_243_split_sizes_0 = const()[name = tensor<string, []>("op_243_split_sizes_0"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_243_axis_0 = const()[name = tensor<string, []>("op_243_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 1, 1]> var_243_cast_fp16_0, tensor<fp16, [1, 32, 1, 1]> var_243_cast_fp16_1 = split(axis = var_243_axis_0, split_sizes = var_243_split_sizes_0, x = var_242_cast_fp16)[name = tensor<string, []>("op_243_cast_fp16")];
            tensor<fp16, []> var_245_promoted_to_fp16 = const()[name = tensor<string, []>("op_245_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 32, 1, 1]> var_246_cast_fp16 = add(x = var_243_cast_fp16_0, y = var_245_promoted_to_fp16)[name = tensor<string, []>("op_246_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> var_247_cast_fp16 = mul(x = reshape_5_cast_fp16, y = var_246_cast_fp16)[name = tensor<string, []>("op_247_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_23_cast_fp16 = add(x = var_247_cast_fp16, y = var_243_cast_fp16_1)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_25_cast_fp16 = silu(x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<int32, [2]> var_252 = const()[name = tensor<string, []>("op_252"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_254 = const()[name = tensor<string, []>("op_254"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_17_pad_type_0 = const()[name = tensor<string, []>("x_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_17_pad_0 = const()[name = tensor<string, []>("x_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> inner_model_unet_d_blocks_0_resblocks_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv1_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1300096)))];
            tensor<fp16, [32]> inner_model_unet_d_blocks_0_resblocks_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1318592)))];
            tensor<fp16, [1, 32, 64, 64]> x_17_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_1_conv1_bias_to_fp16, dilations = var_254, groups = var_85, pad = x_17_pad_0, pad_type = x_17_pad_type_0, strides = var_252, weight = inner_model_unet_d_blocks_0_resblocks_1_conv1_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<int32, [5]> reshape_6_shape_0 = const()[name = tensor<string, []>("reshape_6_shape_0"), val = tensor<int32, [5]>([1, 1, 32, 64, 64])];
            tensor<fp16, [1, 1, 32, 64, 64]> reshape_6_cast_fp16 = reshape(shape = reshape_6_shape_0, x = x_17_cast_fp16)[name = tensor<string, []>("reshape_6_cast_fp16")];
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_9_cast_fp16 = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_6_cast_fp16)[name = tensor<string, []>("reduce_mean_9_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> sub_6_cast_fp16 = sub(x = reshape_6_cast_fp16, y = reduce_mean_9_cast_fp16)[name = tensor<string, []>("sub_6_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> square_3_cast_fp16 = square(x = sub_6_cast_fp16)[name = tensor<string, []>("square_3_cast_fp16")];
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_11_cast_fp16 = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast_fp16)[name = tensor<string, []>("reduce_mean_11_cast_fp16")];
            tensor<fp16, []> add_3_y_0_to_fp16 = const()[name = tensor<string, []>("add_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1, 1]> add_3_cast_fp16 = add(x = reduce_mean_11_cast_fp16, y = add_3_y_0_to_fp16)[name = tensor<string, []>("add_3_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1, 1]> sqrt_3_cast_fp16 = sqrt(x = add_3_cast_fp16)[name = tensor<string, []>("sqrt_3_cast_fp16")];
            tensor<fp16, [1, 1, 32, 64, 64]> real_div_3_cast_fp16 = real_div(x = sub_6_cast_fp16, y = sqrt_3_cast_fp16)[name = tensor<string, []>("real_div_3_cast_fp16")];
            tensor<int32, [4]> reshape_7_shape_0 = const()[name = tensor<string, []>("reshape_7_shape_0"), val = tensor<int32, [4]>([1, 32, 64, 64])];
            tensor<fp16, [1, 32, 64, 64]> reshape_7_cast_fp16 = reshape(shape = reshape_7_shape_0, x = real_div_3_cast_fp16)[name = tensor<string, []>("reshape_7_cast_fp16")];
            tensor<fp16, [64, 512]> inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_weight_to_fp16"), val = tensor<fp16, [64, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1318720)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1384320)))];
            tensor<fp16, [1, 64]> linear_5_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [1]> var_264_axes_0 = const()[name = tensor<string, []>("op_264_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 1]> var_264_cast_fp16 = expand_dims(axes = var_264_axes_0, x = linear_5_cast_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<int32, [1]> var_265_axes_0 = const()[name = tensor<string, []>("op_265_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 64, 1, 1]> var_265_cast_fp16 = expand_dims(axes = var_265_axes_0, x = var_264_cast_fp16)[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<int32, [2]> var_266_split_sizes_0 = const()[name = tensor<string, []>("op_266_split_sizes_0"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_266_axis_0 = const()[name = tensor<string, []>("op_266_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 1, 1]> var_266_cast_fp16_0, tensor<fp16, [1, 32, 1, 1]> var_266_cast_fp16_1 = split(axis = var_266_axis_0, split_sizes = var_266_split_sizes_0, x = var_265_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<fp16, []> var_268_promoted_to_fp16 = const()[name = tensor<string, []>("op_268_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 32, 1, 1]> var_269_cast_fp16 = add(x = var_266_cast_fp16_0, y = var_268_promoted_to_fp16)[name = tensor<string, []>("op_269_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> var_270_cast_fp16 = mul(x = reshape_7_cast_fp16, y = var_269_cast_fp16)[name = tensor<string, []>("op_270_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_27_cast_fp16 = add(x = var_270_cast_fp16, y = var_266_cast_fp16_1)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_29_cast_fp16 = silu(x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [2]> var_275 = const()[name = tensor<string, []>("op_275"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_277 = const()[name = tensor<string, []>("op_277"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_21_pad_type_0 = const()[name = tensor<string, []>("x_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_21_pad_0 = const()[name = tensor<string, []>("x_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> inner_model_unet_d_blocks_0_resblocks_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv2_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1384512)))];
            tensor<fp16, [32]> inner_model_unet_d_blocks_0_resblocks_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1403008)))];
            tensor<fp16, [1, 32, 64, 64]> x_21_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_1_conv2_bias_to_fp16, dilations = var_277, groups = var_85, pad = x_21_pad_0, pad_type = x_21_pad_type_0, strides = var_275, weight = inner_model_unet_d_blocks_0_resblocks_1_conv2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [1, 32, 64, 64]> input_31_cast_fp16 = add(x = x_21_cast_fp16, y = x_13_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [2]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_289 = const()[name = tensor<string, []>("op_289"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> inner_model_unet_downsamples_1_conv_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_downsamples_1_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1403136)))];
            tensor<fp16, [32]> inner_model_unet_downsamples_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_downsamples_1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1421632)))];
            tensor<fp16, [1, 32, 32, 32]> input_33_cast_fp16 = conv(bias = inner_model_unet_downsamples_1_conv_bias_to_fp16, dilations = var_289, groups = var_85, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_287, weight = inner_model_unet_downsamples_1_conv_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [2]> var_303 = const()[name = tensor<string, []>("op_303"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_305 = const()[name = tensor<string, []>("op_305"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> r_1_pad_type_0 = const()[name = tensor<string, []>("r_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> r_1_pad_0 = const()[name = tensor<string, []>("r_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> inner_model_unet_d_blocks_1_resblocks_0_proj_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_proj_weight_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1421760)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_1_resblocks_0_proj_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_proj_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1425920)))];
            tensor<fp16, [1, 64, 32, 32]> r_1_cast_fp16 = conv(bias = inner_model_unet_d_blocks_1_resblocks_0_proj_bias_to_fp16, dilations = var_305, groups = var_85, pad = r_1_pad_0, pad_type = r_1_pad_type_0, strides = var_303, weight = inner_model_unet_d_blocks_1_resblocks_0_proj_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("r_1_cast_fp16")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([1, 1, 32, 32, 32])];
            tensor<fp16, [1, 1, 32, 32, 32]> reshape_8_cast_fp16 = reshape(shape = reshape_8_shape_0, x = input_33_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_12_cast_fp16 = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_8_cast_fp16)[name = tensor<string, []>("reduce_mean_12_cast_fp16")];
            tensor<fp16, [1, 1, 32, 32, 32]> sub_8_cast_fp16 = sub(x = reshape_8_cast_fp16, y = reduce_mean_12_cast_fp16)[name = tensor<string, []>("sub_8_cast_fp16")];
            tensor<fp16, [1, 1, 32, 32, 32]> square_4_cast_fp16 = square(x = sub_8_cast_fp16)[name = tensor<string, []>("square_4_cast_fp16")];
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 1, 1, 1, 1]> reduce_mean_14_cast_fp16 = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast_fp16)[name = tensor<string, []>("reduce_mean_14_cast_fp16")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1, 1]> add_4_cast_fp16 = add(x = reduce_mean_14_cast_fp16, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast_fp16")];
            tensor<fp16, [1, 1, 1, 1, 1]> sqrt_4_cast_fp16 = sqrt(x = add_4_cast_fp16)[name = tensor<string, []>("sqrt_4_cast_fp16")];
            tensor<fp16, [1, 1, 32, 32, 32]> real_div_4_cast_fp16 = real_div(x = sub_8_cast_fp16, y = sqrt_4_cast_fp16)[name = tensor<string, []>("real_div_4_cast_fp16")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([1, 32, 32, 32])];
            tensor<fp16, [1, 32, 32, 32]> reshape_9_cast_fp16 = reshape(shape = reshape_9_shape_0, x = real_div_4_cast_fp16)[name = tensor<string, []>("reshape_9_cast_fp16")];
            tensor<fp16, [64, 512]> inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_weight_to_fp16"), val = tensor<fp16, [64, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1426112)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1491712)))];
            tensor<fp16, [1, 64]> linear_6_cast_fp16 = linear(bias = inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [1]> var_315_axes_0 = const()[name = tensor<string, []>("op_315_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 1]> var_315_cast_fp16 = expand_dims(axes = var_315_axes_0, x = linear_6_cast_fp16)[name = tensor<string, []>("op_315_cast_fp16")];
            tensor<int32, [1]> var_316_axes_0 = const()[name = tensor<string, []>("op_316_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 64, 1, 1]> var_316_cast_fp16 = expand_dims(axes = var_316_axes_0, x = var_315_cast_fp16)[name = tensor<string, []>("op_316_cast_fp16")];
            tensor<int32, [2]> var_317_split_sizes_0 = const()[name = tensor<string, []>("op_317_split_sizes_0"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_317_axis_0 = const()[name = tensor<string, []>("op_317_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 1, 1]> var_317_cast_fp16_0, tensor<fp16, [1, 32, 1, 1]> var_317_cast_fp16_1 = split(axis = var_317_axis_0, split_sizes = var_317_split_sizes_0, x = var_316_cast_fp16)[name = tensor<string, []>("op_317_cast_fp16")];
            tensor<fp16, []> var_319_promoted_to_fp16 = const()[name = tensor<string, []>("op_319_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 32, 1, 1]> var_320_cast_fp16 = add(x = var_317_cast_fp16_0, y = var_319_promoted_to_fp16)[name = tensor<string, []>("op_320_cast_fp16")];
            tensor<fp16, [1, 32, 32, 32]> var_321_cast_fp16 = mul(x = reshape_9_cast_fp16, y = var_320_cast_fp16)[name = tensor<string, []>("op_321_cast_fp16")];
            tensor<fp16, [1, 32, 32, 32]> input_35_cast_fp16 = add(x = var_321_cast_fp16, y = var_317_cast_fp16_1)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [1, 32, 32, 32]> input_37_cast_fp16 = silu(x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<int32, [2]> var_326 = const()[name = tensor<string, []>("op_326"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_328 = const()[name = tensor<string, []>("op_328"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_25_pad_type_0 = const()[name = tensor<string, []>("x_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_25_pad_0 = const()[name = tensor<string, []>("x_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
