program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3400.43.1"}, {"coremlc-version", "3400.58.2"}, {"coremltools-component-torch", "2.2.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2"}})]
{
    func main<ios17>(tensor<fp16, [1, 3, 64, 64]> noisy_next_obs, tensor<fp32, [1, 4]> prev_act, tensor<fp16, [1, 12, 64, 64]> prev_obs, tensor<fp16, [1]> sigma) {
            tensor<fp16, [1]> sigma_adj_cast_fp16 = identity(x = sigma)[name = tensor<string, []>("sigma_adj_cast_fp16")];
            tensor<fp16, []> var_12_promoted_to_fp16 = const()[name = tensor<string, []>("op_12_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1]> var_13_cast_fp16 = pow(x = sigma_adj_cast_fp16, y = var_12_promoted_to_fp16)[name = tensor<string, []>("op_13_cast_fp16")];
            tensor<fp16, []> var_15_to_fp16 = const()[name = tensor<string, []>("op_15_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1]> var_16_cast_fp16 = add(x = var_13_cast_fp16, y = var_15_to_fp16)[name = tensor<string, []>("op_16_cast_fp16")];
            tensor<fp16, [1]> var_17_cast_fp16 = sqrt(x = var_16_cast_fp16)[name = tensor<string, []>("op_17_cast_fp16")];
            tensor<fp32, []> var_18_epsilon_0 = const()[name = tensor<string, []>("op_18_epsilon_0"), val = tensor<fp32, []>(0x1.a36e2ep-14)];
            tensor<fp16, [1]> var_18_cast_fp16 = inverse(epsilon = var_18_epsilon_0, x = var_17_cast_fp16)[name = tensor<string, []>("op_18_cast_fp16")];
            tensor<fp32, []> var_26_epsilon_0 = const()[name = tensor<string, []>("op_26_epsilon_0"), val = tensor<fp32, []>(0x1.a36e2ep-14)];
            tensor<fp16, [1]> var_26_cast_fp16 = inverse(epsilon = var_26_epsilon_0, x = var_16_cast_fp16)[name = tensor<string, []>("op_26_cast_fp16")];
            tensor<fp16, []> var_27_to_fp16 = const()[name = tensor<string, []>("op_27_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1]> c_skip_1_cast_fp16 = mul(x = var_26_cast_fp16, y = var_27_to_fp16)[name = tensor<string, []>("c_skip_1_cast_fp16")];
            tensor<fp16, [1]> var_29_cast_fp16 = sqrt(x = c_skip_1_cast_fp16)[name = tensor<string, []>("op_29_cast_fp16")];
            tensor<fp16, [1]> c_out_1_cast_fp16 = mul(x = sigma_adj_cast_fp16, y = var_29_cast_fp16)[name = tensor<string, []>("c_out_1_cast_fp16")];
            tensor<fp32, []> var_31_epsilon_0 = const()[name = tensor<string, []>("op_31_epsilon_0"), val = tensor<fp32, []>(0x1p-149)];
            tensor<fp16, [1]> var_31_cast_fp16 = log(epsilon = var_31_epsilon_0, x = sigma_adj_cast_fp16)[name = tensor<string, []>("op_31_cast_fp16")];
            tensor<fp16, []> _inversed_c_noise_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_c_noise_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1]> _inversed_c_noise_cast_fp16 = mul(x = var_31_cast_fp16, y = _inversed_c_noise_y_0_to_fp16)[name = tensor<string, []>("_inversed_c_noise_cast_fp16")];
            tensor<int32, [4]> var_44 = const()[name = tensor<string, []>("op_44"), val = tensor<int32, [4]>([-1, 1, 1, 1])];
            tensor<fp16, [1, 1, 1, 1]> c_in_cast_fp16 = reshape(shape = var_44, x = var_18_cast_fp16)[name = tensor<string, []>("c_in_cast_fp16")];
            tensor<int32, [4]> var_50 = const()[name = tensor<string, []>("op_50"), val = tensor<int32, [4]>([-1, 1, 1, 1])];
            tensor<fp16, [1, 1, 1, 1]> c_skip_cast_fp16 = reshape(shape = var_50, x = c_skip_1_cast_fp16)[name = tensor<string, []>("c_skip_cast_fp16")];
            tensor<int32, [4]> var_56 = const()[name = tensor<string, []>("op_56"), val = tensor<int32, [4]>([-1, 1, 1, 1])];
            tensor<fp16, [1, 1, 1, 1]> c_out_cast_fp16 = reshape(shape = var_56, x = c_out_1_cast_fp16)[name = tensor<string, []>("c_out_cast_fp16")];
            tensor<fp16, []> _inversed_obs_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_obs_y_0_to_fp16"), val = tensor<fp16, []>(0x1p+1)];
            tensor<fp16, [1, 12, 64, 64]> _inversed_obs_cast_fp16 = mul(x = prev_obs, y = _inversed_obs_y_0_to_fp16)[name = tensor<string, []>("_inversed_obs_cast_fp16")];
            tensor<fp16, [1, 3, 64, 64]> noisy_next_obs_cast_fp16 = mul(x = noisy_next_obs, y = c_in_cast_fp16)[name = tensor<string, []>("noisy_next_obs_cast_fp16")];
            tensor<int32, []> var_76 = const()[name = tensor<string, []>("op_76"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_77 = const()[name = tensor<string, []>("op_77"), val = tensor<int32, []>(1)];
            tensor<int32, []> input_1_axis_0 = const()[name = tensor<string, []>("input_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> input_1_batch_dims_0 = const()[name = tensor<string, []>("input_1_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> input_1_validate_indices_0 = const()[name = tensor<string, []>("input_1_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [3, 64]> inner_model_act_emb_0_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_act_emb_0_weight_to_fp16"), val = tensor<fp16, [3, 64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<string, []> cast_10_to_int16_dtype_0 = const()[name = tensor<string, []>("cast_10_to_int16_dtype_0"), val = tensor<string, []>("int16")];
            tensor<int16, [1, 4]> cast_21 = cast(dtype = cast_10_to_int16_dtype_0, x = prev_act)[name = tensor<string, []>("cast_21")];
            tensor<fp16, [1, 4, 64]> input_1_cast_fp16_cast_uint16 = gather(axis = input_1_axis_0, batch_dims = input_1_batch_dims_0, indices = cast_21, validate_indices = input_1_validate_indices_0, x = inner_model_act_emb_0_weight_to_fp16)[name = tensor<string, []>("input_1_cast_fp16_cast_uint16")];
            tensor<int32, [2]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> act_emb_1_cast_fp16 = reshape(shape = concat_0, x = input_1_cast_fp16_cast_uint16)[name = tensor<string, []>("act_emb_1_cast_fp16")];
            tensor<int32, [1]> var_91_axes_0 = const()[name = tensor<string, []>("op_91_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1]> var_91_cast_fp16 = expand_dims(axes = var_91_axes_0, x = _inversed_c_noise_cast_fp16)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<fp16, []> var_92_to_fp16 = const()[name = tensor<string, []>("op_92_to_fp16"), val = tensor<fp16, []>(0x1.92p+2)];
            tensor<fp16, [1, 1]> var_93_cast_fp16 = mul(x = var_91_cast_fp16, y = var_92_to_fp16)[name = tensor<string, []>("op_93_cast_fp16")];
            tensor<fp16, [128, 1]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [128, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(512)))];
            tensor<fp16, [128]> f_1_bias_0_to_fp16 = const()[name = tensor<string, []>("f_1_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(832)))];
            tensor<fp16, [1, 128]> f_1_cast_fp16 = linear(bias = f_1_bias_0_to_fp16, weight = transpose_0_to_fp16, x = var_93_cast_fp16)[name = tensor<string, []>("f_1_cast_fp16")];
            tensor<fp16, [1, 128]> var_95_cast_fp16 = cos(x = f_1_cast_fp16)[name = tensor<string, []>("op_95_cast_fp16")];
            tensor<fp16, [1, 128]> var_96_cast_fp16 = sin(x = f_1_cast_fp16)[name = tensor<string, []>("op_96_cast_fp16")];
            tensor<bool, []> var_98_interleave_0 = const()[name = tensor<string, []>("op_98_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256]> var_98_cast_fp16 = concat(axis = var_76, interleave = var_98_interleave_0, values = (var_95_cast_fp16, var_96_cast_fp16))[name = tensor<string, []>("op_98_cast_fp16")];
            tensor<fp16, [1, 256]> var_107_to_fp16 = const()[name = tensor<string, []>("op_107_to_fp16"), val = tensor<fp16, [1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp16, [1, 256]> var_108_cast_fp16 = add(x = var_98_cast_fp16, y = var_107_to_fp16)[name = tensor<string, []>("op_108_cast_fp16")];
            tensor<fp16, [1, 256]> input_5_cast_fp16 = add(x = var_108_cast_fp16, y = act_emb_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [256, 256]> inner_model_cond_proj_0_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_0_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1728)))];
            tensor<fp16, [256]> inner_model_cond_proj_0_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132864)))];
            tensor<fp16, [1, 256]> linear_0_cast_fp16 = linear(bias = inner_model_cond_proj_0_bias_to_fp16, weight = inner_model_cond_proj_0_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [1, 256]> input_9_cast_fp16 = silu(x = linear_0_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [256, 256]> inner_model_cond_proj_2_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_2_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133440)))];
            tensor<fp16, [256]> inner_model_cond_proj_2_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_cond_proj_2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(264576)))];
            tensor<fp16, [1, 256]> linear_1_cast_fp16 = linear(bias = inner_model_cond_proj_2_bias_to_fp16, weight = inner_model_cond_proj_2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<bool, []> input_11_interleave_0 = const()[name = tensor<string, []>("input_11_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 15, 64, 64]> input_11_cast_fp16 = concat(axis = var_77, interleave = input_11_interleave_0, values = (_inversed_obs_cast_fp16, noisy_next_obs_cast_fp16))[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_123 = const()[name = tensor<string, []>("op_123"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_125 = const()[name = tensor<string, []>("op_125"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_1_pad_type_0 = const()[name = tensor<string, []>("x_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 15, 3, 3]> inner_model_conv_in_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_conv_in_weight_to_fp16"), val = tensor<fp16, [64, 15, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(265152)))];
            tensor<fp16, [64]> inner_model_conv_in_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_conv_in_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(282496)))];
            tensor<fp16, [1, 64, 64, 64]> x_1_cast_fp16 = conv(bias = inner_model_conv_in_bias_to_fp16, dilations = var_125, groups = var_77, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = var_123, weight = inner_model_conv_in_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([1, 2, 32, 64, 64])];
            tensor<fp16, [1, 2, 32, 64, 64]> reshape_0_cast_fp16 = reshape(shape = reshape_0_shape_0, x = x_1_cast_fp16)[name = tensor<string, []>("reshape_0_cast_fp16")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_0_cast_fp16 = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast_fp16)[name = tensor<string, []>("reduce_mean_0_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> sub_0_cast_fp16 = sub(x = reshape_0_cast_fp16, y = reduce_mean_0_cast_fp16)[name = tensor<string, []>("sub_0_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> square_0_cast_fp16 = square(x = sub_0_cast_fp16)[name = tensor<string, []>("square_0_cast_fp16")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_2_cast_fp16 = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast_fp16)[name = tensor<string, []>("reduce_mean_2_cast_fp16")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 2, 1, 1, 1]> add_0_cast_fp16 = add(x = reduce_mean_2_cast_fp16, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast_fp16")];
            tensor<fp16, [1, 2, 1, 1, 1]> sqrt_0_cast_fp16 = sqrt(x = add_0_cast_fp16)[name = tensor<string, []>("sqrt_0_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> real_div_0_cast_fp16 = real_div(x = sub_0_cast_fp16, y = sqrt_0_cast_fp16)[name = tensor<string, []>("real_div_0_cast_fp16")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([1, 64, 64, 64])];
            tensor<fp16, [1, 64, 64, 64]> reshape_1_cast_fp16 = reshape(shape = reshape_1_shape_0, x = real_div_0_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<fp16, [128, 256]> inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_weight_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(282688)))];
            tensor<fp16, [128]> inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(348288)))];
            tensor<fp16, [1, 128]> linear_2_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_0_norm1_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [1]> var_182_axes_0 = const()[name = tensor<string, []>("op_182_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1]> var_182_cast_fp16 = expand_dims(axes = var_182_axes_0, x = linear_2_cast_fp16)[name = tensor<string, []>("op_182_cast_fp16")];
            tensor<int32, [1]> var_183_axes_0 = const()[name = tensor<string, []>("op_183_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 128, 1, 1]> var_183_cast_fp16 = expand_dims(axes = var_183_axes_0, x = var_182_cast_fp16)[name = tensor<string, []>("op_183_cast_fp16")];
            tensor<int32, [2]> var_184_split_sizes_0 = const()[name = tensor<string, []>("op_184_split_sizes_0"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_184_axis_0 = const()[name = tensor<string, []>("op_184_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1]> var_184_cast_fp16_0, tensor<fp16, [1, 64, 1, 1]> var_184_cast_fp16_1 = split(axis = var_184_axis_0, split_sizes = var_184_split_sizes_0, x = var_183_cast_fp16)[name = tensor<string, []>("op_184_cast_fp16")];
            tensor<fp16, []> var_186_promoted_to_fp16 = const()[name = tensor<string, []>("op_186_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 64, 1, 1]> var_187_cast_fp16 = add(x = var_184_cast_fp16_0, y = var_186_promoted_to_fp16)[name = tensor<string, []>("op_187_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> var_188_cast_fp16 = mul(x = reshape_1_cast_fp16, y = var_187_cast_fp16)[name = tensor<string, []>("op_188_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_15_cast_fp16 = add(x = var_188_cast_fp16, y = var_184_cast_fp16_1)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_17_cast_fp16 = silu(x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [2]> var_193 = const()[name = tensor<string, []>("op_193"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_195 = const()[name = tensor<string, []>("op_195"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_7_pad_type_0 = const()[name = tensor<string, []>("x_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_7_pad_0 = const()[name = tensor<string, []>("x_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> inner_model_unet_d_blocks_0_resblocks_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv1_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(348608)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(422400)))];
            tensor<fp16, [1, 64, 64, 64]> x_7_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_0_conv1_bias_to_fp16, dilations = var_195, groups = var_77, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = var_193, weight = inner_model_unet_d_blocks_0_resblocks_0_conv1_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [5]> reshape_2_shape_0 = const()[name = tensor<string, []>("reshape_2_shape_0"), val = tensor<int32, [5]>([1, 2, 32, 64, 64])];
            tensor<fp16, [1, 2, 32, 64, 64]> reshape_2_cast_fp16 = reshape(shape = reshape_2_shape_0, x = x_7_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_3_cast_fp16 = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_2_cast_fp16)[name = tensor<string, []>("reduce_mean_3_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> sub_2_cast_fp16 = sub(x = reshape_2_cast_fp16, y = reduce_mean_3_cast_fp16)[name = tensor<string, []>("sub_2_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> square_1_cast_fp16 = square(x = sub_2_cast_fp16)[name = tensor<string, []>("square_1_cast_fp16")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_5_cast_fp16 = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast_fp16)[name = tensor<string, []>("reduce_mean_5_cast_fp16")];
            tensor<fp16, []> add_1_y_0_to_fp16 = const()[name = tensor<string, []>("add_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 2, 1, 1, 1]> add_1_cast_fp16 = add(x = reduce_mean_5_cast_fp16, y = add_1_y_0_to_fp16)[name = tensor<string, []>("add_1_cast_fp16")];
            tensor<fp16, [1, 2, 1, 1, 1]> sqrt_1_cast_fp16 = sqrt(x = add_1_cast_fp16)[name = tensor<string, []>("sqrt_1_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> real_div_1_cast_fp16 = real_div(x = sub_2_cast_fp16, y = sqrt_1_cast_fp16)[name = tensor<string, []>("real_div_1_cast_fp16")];
            tensor<int32, [4]> reshape_3_shape_0 = const()[name = tensor<string, []>("reshape_3_shape_0"), val = tensor<int32, [4]>([1, 64, 64, 64])];
            tensor<fp16, [1, 64, 64, 64]> reshape_3_cast_fp16 = reshape(shape = reshape_3_shape_0, x = real_div_1_cast_fp16)[name = tensor<string, []>("reshape_3_cast_fp16")];
            tensor<fp16, [128, 256]> inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_weight_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(422592)))];
            tensor<fp16, [128]> inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(488192)))];
            tensor<fp16, [1, 128]> linear_3_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_0_norm2_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<int32, [1]> var_205_axes_0 = const()[name = tensor<string, []>("op_205_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1]> var_205_cast_fp16 = expand_dims(axes = var_205_axes_0, x = linear_3_cast_fp16)[name = tensor<string, []>("op_205_cast_fp16")];
            tensor<int32, [1]> var_206_axes_0 = const()[name = tensor<string, []>("op_206_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 128, 1, 1]> var_206_cast_fp16 = expand_dims(axes = var_206_axes_0, x = var_205_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [2]> var_207_split_sizes_0 = const()[name = tensor<string, []>("op_207_split_sizes_0"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_207_axis_0 = const()[name = tensor<string, []>("op_207_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1]> var_207_cast_fp16_0, tensor<fp16, [1, 64, 1, 1]> var_207_cast_fp16_1 = split(axis = var_207_axis_0, split_sizes = var_207_split_sizes_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_207_cast_fp16")];
            tensor<fp16, []> var_209_promoted_to_fp16 = const()[name = tensor<string, []>("op_209_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 64, 1, 1]> var_210_cast_fp16 = add(x = var_207_cast_fp16_0, y = var_209_promoted_to_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> var_211_cast_fp16 = mul(x = reshape_3_cast_fp16, y = var_210_cast_fp16)[name = tensor<string, []>("op_211_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_19_cast_fp16 = add(x = var_211_cast_fp16, y = var_207_cast_fp16_1)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_21_cast_fp16 = silu(x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [2]> var_216 = const()[name = tensor<string, []>("op_216"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_218 = const()[name = tensor<string, []>("op_218"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_11_pad_type_0 = const()[name = tensor<string, []>("x_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_11_pad_0 = const()[name = tensor<string, []>("x_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> inner_model_unet_d_blocks_0_resblocks_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv2_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(488512)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_0_conv2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(562304)))];
            tensor<fp16, [1, 64, 64, 64]> x_11_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_0_conv2_bias_to_fp16, dilations = var_218, groups = var_77, pad = x_11_pad_0, pad_type = x_11_pad_type_0, strides = var_216, weight = inner_model_unet_d_blocks_0_resblocks_0_conv2_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> x_13_cast_fp16 = add(x = x_11_cast_fp16, y = x_1_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([1, 2, 32, 64, 64])];
            tensor<fp16, [1, 2, 32, 64, 64]> reshape_4_cast_fp16 = reshape(shape = reshape_4_shape_0, x = x_13_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_6_cast_fp16 = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_4_cast_fp16)[name = tensor<string, []>("reduce_mean_6_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> sub_4_cast_fp16 = sub(x = reshape_4_cast_fp16, y = reduce_mean_6_cast_fp16)[name = tensor<string, []>("sub_4_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> square_2_cast_fp16 = square(x = sub_4_cast_fp16)[name = tensor<string, []>("square_2_cast_fp16")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_8_cast_fp16 = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast_fp16)[name = tensor<string, []>("reduce_mean_8_cast_fp16")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 2, 1, 1, 1]> add_2_cast_fp16 = add(x = reduce_mean_8_cast_fp16, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast_fp16")];
            tensor<fp16, [1, 2, 1, 1, 1]> sqrt_2_cast_fp16 = sqrt(x = add_2_cast_fp16)[name = tensor<string, []>("sqrt_2_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> real_div_2_cast_fp16 = real_div(x = sub_4_cast_fp16, y = sqrt_2_cast_fp16)[name = tensor<string, []>("real_div_2_cast_fp16")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([1, 64, 64, 64])];
            tensor<fp16, [1, 64, 64, 64]> reshape_5_cast_fp16 = reshape(shape = reshape_5_shape_0, x = real_div_2_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<fp16, [128, 256]> inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_weight_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(562496)))];
            tensor<fp16, [128]> inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(628096)))];
            tensor<fp16, [1, 128]> linear_4_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_1_norm1_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [1]> var_233_axes_0 = const()[name = tensor<string, []>("op_233_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1]> var_233_cast_fp16 = expand_dims(axes = var_233_axes_0, x = linear_4_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<int32, [1]> var_234_axes_0 = const()[name = tensor<string, []>("op_234_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 128, 1, 1]> var_234_cast_fp16 = expand_dims(axes = var_234_axes_0, x = var_233_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<int32, [2]> var_235_split_sizes_0 = const()[name = tensor<string, []>("op_235_split_sizes_0"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_235_axis_0 = const()[name = tensor<string, []>("op_235_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1]> var_235_cast_fp16_0, tensor<fp16, [1, 64, 1, 1]> var_235_cast_fp16_1 = split(axis = var_235_axis_0, split_sizes = var_235_split_sizes_0, x = var_234_cast_fp16)[name = tensor<string, []>("op_235_cast_fp16")];
            tensor<fp16, []> var_237_promoted_to_fp16 = const()[name = tensor<string, []>("op_237_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 64, 1, 1]> var_238_cast_fp16 = add(x = var_235_cast_fp16_0, y = var_237_promoted_to_fp16)[name = tensor<string, []>("op_238_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> var_239_cast_fp16 = mul(x = reshape_5_cast_fp16, y = var_238_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_23_cast_fp16 = add(x = var_239_cast_fp16, y = var_235_cast_fp16_1)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_25_cast_fp16 = silu(x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<int32, [2]> var_244 = const()[name = tensor<string, []>("op_244"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_246 = const()[name = tensor<string, []>("op_246"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_17_pad_type_0 = const()[name = tensor<string, []>("x_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_17_pad_0 = const()[name = tensor<string, []>("x_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> inner_model_unet_d_blocks_0_resblocks_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv1_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(628416)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(702208)))];
            tensor<fp16, [1, 64, 64, 64]> x_17_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_1_conv1_bias_to_fp16, dilations = var_246, groups = var_77, pad = x_17_pad_0, pad_type = x_17_pad_type_0, strides = var_244, weight = inner_model_unet_d_blocks_0_resblocks_1_conv1_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<int32, [5]> reshape_6_shape_0 = const()[name = tensor<string, []>("reshape_6_shape_0"), val = tensor<int32, [5]>([1, 2, 32, 64, 64])];
            tensor<fp16, [1, 2, 32, 64, 64]> reshape_6_cast_fp16 = reshape(shape = reshape_6_shape_0, x = x_17_cast_fp16)[name = tensor<string, []>("reshape_6_cast_fp16")];
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_9_cast_fp16 = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_6_cast_fp16)[name = tensor<string, []>("reduce_mean_9_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> sub_6_cast_fp16 = sub(x = reshape_6_cast_fp16, y = reduce_mean_9_cast_fp16)[name = tensor<string, []>("sub_6_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> square_3_cast_fp16 = square(x = sub_6_cast_fp16)[name = tensor<string, []>("square_3_cast_fp16")];
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_11_cast_fp16 = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast_fp16)[name = tensor<string, []>("reduce_mean_11_cast_fp16")];
            tensor<fp16, []> add_3_y_0_to_fp16 = const()[name = tensor<string, []>("add_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 2, 1, 1, 1]> add_3_cast_fp16 = add(x = reduce_mean_11_cast_fp16, y = add_3_y_0_to_fp16)[name = tensor<string, []>("add_3_cast_fp16")];
            tensor<fp16, [1, 2, 1, 1, 1]> sqrt_3_cast_fp16 = sqrt(x = add_3_cast_fp16)[name = tensor<string, []>("sqrt_3_cast_fp16")];
            tensor<fp16, [1, 2, 32, 64, 64]> real_div_3_cast_fp16 = real_div(x = sub_6_cast_fp16, y = sqrt_3_cast_fp16)[name = tensor<string, []>("real_div_3_cast_fp16")];
            tensor<int32, [4]> reshape_7_shape_0 = const()[name = tensor<string, []>("reshape_7_shape_0"), val = tensor<int32, [4]>([1, 64, 64, 64])];
            tensor<fp16, [1, 64, 64, 64]> reshape_7_cast_fp16 = reshape(shape = reshape_7_shape_0, x = real_div_3_cast_fp16)[name = tensor<string, []>("reshape_7_cast_fp16")];
            tensor<fp16, [128, 256]> inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_weight_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(702400)))];
            tensor<fp16, [128]> inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(768000)))];
            tensor<fp16, [1, 128]> linear_5_cast_fp16 = linear(bias = inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_0_resblocks_1_norm2_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [1]> var_256_axes_0 = const()[name = tensor<string, []>("op_256_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1]> var_256_cast_fp16 = expand_dims(axes = var_256_axes_0, x = linear_5_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<int32, [1]> var_257_axes_0 = const()[name = tensor<string, []>("op_257_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 128, 1, 1]> var_257_cast_fp16 = expand_dims(axes = var_257_axes_0, x = var_256_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<int32, [2]> var_258_split_sizes_0 = const()[name = tensor<string, []>("op_258_split_sizes_0"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_258_axis_0 = const()[name = tensor<string, []>("op_258_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1]> var_258_cast_fp16_0, tensor<fp16, [1, 64, 1, 1]> var_258_cast_fp16_1 = split(axis = var_258_axis_0, split_sizes = var_258_split_sizes_0, x = var_257_cast_fp16)[name = tensor<string, []>("op_258_cast_fp16")];
            tensor<fp16, []> var_260_promoted_to_fp16 = const()[name = tensor<string, []>("op_260_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 64, 1, 1]> var_261_cast_fp16 = add(x = var_258_cast_fp16_0, y = var_260_promoted_to_fp16)[name = tensor<string, []>("op_261_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> var_262_cast_fp16 = mul(x = reshape_7_cast_fp16, y = var_261_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_27_cast_fp16 = add(x = var_262_cast_fp16, y = var_258_cast_fp16_1)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_29_cast_fp16 = silu(x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [2]> var_267 = const()[name = tensor<string, []>("op_267"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_21_pad_type_0 = const()[name = tensor<string, []>("x_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_21_pad_0 = const()[name = tensor<string, []>("x_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> inner_model_unet_d_blocks_0_resblocks_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv2_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(768320)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_0_resblocks_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_0_resblocks_1_conv2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(842112)))];
            tensor<fp16, [1, 64, 64, 64]> x_21_cast_fp16 = conv(bias = inner_model_unet_d_blocks_0_resblocks_1_conv2_bias_to_fp16, dilations = var_269, groups = var_77, pad = x_21_pad_0, pad_type = x_21_pad_type_0, strides = var_267, weight = inner_model_unet_d_blocks_0_resblocks_1_conv2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> input_31_cast_fp16 = add(x = x_21_cast_fp16, y = x_13_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [2]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_23_pad_type_0 = const()[name = tensor<string, []>("x_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_23_pad_0 = const()[name = tensor<string, []>("x_23_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> inner_model_unet_downsamples_1_conv_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_downsamples_1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(842304)))];
            tensor<fp16, [64]> inner_model_unet_downsamples_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_downsamples_1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(916096)))];
            tensor<fp16, [1, 64, 32, 32]> x_23_cast_fp16 = conv(bias = inner_model_unet_downsamples_1_conv_bias_to_fp16, dilations = var_281, groups = var_77, pad = x_23_pad_0, pad_type = x_23_pad_type_0, strides = var_279, weight = inner_model_unet_downsamples_1_conv_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([1, 2, 32, 32, 32])];
            tensor<fp16, [1, 2, 32, 32, 32]> reshape_8_cast_fp16 = reshape(shape = reshape_8_shape_0, x = x_23_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_12_cast_fp16 = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_8_cast_fp16)[name = tensor<string, []>("reduce_mean_12_cast_fp16")];
            tensor<fp16, [1, 2, 32, 32, 32]> sub_8_cast_fp16 = sub(x = reshape_8_cast_fp16, y = reduce_mean_12_cast_fp16)[name = tensor<string, []>("sub_8_cast_fp16")];
            tensor<fp16, [1, 2, 32, 32, 32]> square_4_cast_fp16 = square(x = sub_8_cast_fp16)[name = tensor<string, []>("square_4_cast_fp16")];
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 2, 1, 1, 1]> reduce_mean_14_cast_fp16 = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast_fp16)[name = tensor<string, []>("reduce_mean_14_cast_fp16")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 2, 1, 1, 1]> add_4_cast_fp16 = add(x = reduce_mean_14_cast_fp16, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast_fp16")];
            tensor<fp16, [1, 2, 1, 1, 1]> sqrt_4_cast_fp16 = sqrt(x = add_4_cast_fp16)[name = tensor<string, []>("sqrt_4_cast_fp16")];
            tensor<fp16, [1, 2, 32, 32, 32]> real_div_4_cast_fp16 = real_div(x = sub_8_cast_fp16, y = sqrt_4_cast_fp16)[name = tensor<string, []>("real_div_4_cast_fp16")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([1, 64, 32, 32])];
            tensor<fp16, [1, 64, 32, 32]> reshape_9_cast_fp16 = reshape(shape = reshape_9_shape_0, x = real_div_4_cast_fp16)[name = tensor<string, []>("reshape_9_cast_fp16")];
            tensor<fp16, [128, 256]> inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_weight_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(916288)))];
            tensor<fp16, [128]> inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(981888)))];
            tensor<fp16, [1, 128]> linear_6_cast_fp16 = linear(bias = inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_bias_to_fp16, weight = inner_model_unet_d_blocks_1_resblocks_0_norm1_linear_weight_to_fp16, x = linear_1_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [1]> var_299_axes_0 = const()[name = tensor<string, []>("op_299_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1]> var_299_cast_fp16 = expand_dims(axes = var_299_axes_0, x = linear_6_cast_fp16)[name = tensor<string, []>("op_299_cast_fp16")];
            tensor<int32, [1]> var_300_axes_0 = const()[name = tensor<string, []>("op_300_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 128, 1, 1]> var_300_cast_fp16 = expand_dims(axes = var_300_axes_0, x = var_299_cast_fp16)[name = tensor<string, []>("op_300_cast_fp16")];
            tensor<int32, [2]> var_301_split_sizes_0 = const()[name = tensor<string, []>("op_301_split_sizes_0"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_301_axis_0 = const()[name = tensor<string, []>("op_301_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1]> var_301_cast_fp16_0, tensor<fp16, [1, 64, 1, 1]> var_301_cast_fp16_1 = split(axis = var_301_axis_0, split_sizes = var_301_split_sizes_0, x = var_300_cast_fp16)[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<fp16, []> var_303_promoted_to_fp16 = const()[name = tensor<string, []>("op_303_promoted_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 64, 1, 1]> var_304_cast_fp16 = add(x = var_301_cast_fp16_0, y = var_303_promoted_to_fp16)[name = tensor<string, []>("op_304_cast_fp16")];
            tensor<fp16, [1, 64, 32, 32]> var_305_cast_fp16 = mul(x = reshape_9_cast_fp16, y = var_304_cast_fp16)[name = tensor<string, []>("op_305_cast_fp16")];
            tensor<fp16, [1, 64, 32, 32]> input_33_cast_fp16 = add(x = var_305_cast_fp16, y = var_301_cast_fp16_1)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 64, 32, 32]> input_35_cast_fp16 = silu(x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [2]> var_310 = const()[name = tensor<string, []>("op_310"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_312 = const()[name = tensor<string, []>("op_312"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_27_pad_type_0 = const()[name = tensor<string, []>("x_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_27_pad_0 = const()[name = tensor<string, []>("x_27_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> inner_model_unet_d_blocks_1_resblocks_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_conv1_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(982208)))];
            tensor<fp16, [64]> inner_model_unet_d_blocks_1_resblocks_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("inner_model_unet_d_blocks_1_resblocks_0_conv1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1056000)))];
            tensor<fp16, [1, 64, 32, 32]> x_27_cast_fp16 = conv(bias = inner_model_unet_d_blocks_1_resblocks_0_conv1_bias_to_fp16, dilations = var_312, groups = var_77, pad = x_27_pad_0, pad_type = x_27_pad_type_0, strides = var_310, weight = inner_model_unet_d_blocks_1_resblocks_0_conv1_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<int32, [5]> reshape_10_shape_0 = const()[name = tensor<string, []>("reshape_10_shape_0"), val = tensor<int32, [5]>([1, 2, 32, 32, 32])];
            tensor<fp16, [1, 2, 32, 32, 32]> reshape_10_cast_fp16 = reshape(shape = reshape_10_shape_0, x = x_27_cast_fp16)[name = tensor<string, []>("reshape_10_cast_fp16")];
            tensor<int32, [3]> reduce_mean_15_axes_0 = const()[name = tensor<string, []>("reduce_mean_15_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
